Microchip-MPLAB-Harmony/dev_packs/Microchip/SAME53_DFP/2.0.3/edc/ATSAME53J18A.PIC
      <edc:AdjustPoint edc:_addr="0x45000070" edc:offset="0x8C"/>
      <edc:SFRDef edc:_addr="0x450000FC" edc:access="---------------r" edc:cname="SISR" edc:impl="0x1" edc:mclr="100000000000000000" edc:nzwidth="0x10" edc:por="100000000000000000" ltx:memberofperipheral="SDHC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC0">
            <edc:SFRFieldDef edc:cname="INTSSL" edc:desc="Interrupt Signal for Each Slot" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x450000FE" edc:access="rrrrrrrrrrrrrrrr" edc:cname="HCVR" edc:mclr="0001100000000010" edc:nzwidth="0x10" edc:por="0001100000000010" ltx:memberofperipheral="SDHC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC0">
            <edc:SFRFieldDef edc:cname="SVER" edc:desc="Spec Version" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="VVER" edc:desc="Vendor Version" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x45000100" edc:offset="0x104"/>
      <edc:SFRDef edc:_addr="0x45000204" edc:access="nnnnn-nn" edc:cname="MC1R" edc:impl="0xFB" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="SDHC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC0">
            <edc:SFRFieldDef edc:cname="CMDTYP" edc:desc="e.MMC Command Type" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="NORMAL" edc:desc="Not a MMC specific command" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="WAITIRQ" edc:desc="Wait IRQ Command" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="STREAM" edc:desc="Stream Command" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="BOOT" edc:desc="Boot Command" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="DDR" edc:desc="e.MMC HSDDR Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OPD" edc:desc="e.MMC Open Drain Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BOOTA" edc:desc="e.MMC Boot Acknowledge Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTN" edc:desc="e.MMC Reset Signal" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FCD" edc:desc="e.MMC Force Card Detect" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x45000205" edc:access="------ww" edc:cname="MC2R" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="SDHC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC0">
            <edc:SFRFieldDef edc:cname="SRESP" edc:desc="e.MMC Abort Wait IRQ" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ABOOT" edc:desc="e.MMC Abort Boot" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x45000206" edc:offset="0x2"/>
      <edc:SFRDef edc:_addr="0x45000208" edc:access="------------------------------nn" edc:cname="ACR" edc:impl="0x3" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SDHC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC0">
            <edc:SFRFieldDef edc:cname="BMAX" edc:desc="AHB Maximum Burst" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="INCR16" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="INCR8" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="INCR4" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="SINGLE" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4500020C" edc:access="-------------------------------n" edc:cname="CC2R" edc:impl="0x1" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SDHC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC0">
            <edc:SFRFieldDef edc:cname="FSDCLKD" edc:desc="Force SDCK Disabled" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="NOEFFECT" edc:desc="No effect" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="SDCLK can be stopped at any time after DATA transfer.SDCLK enable forcing for 8 SDCLK cycles is disabled" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x45000210" edc:offset="0x20"/>
      <edc:SFRDef edc:_addr="0x45000230" edc:access="----------------nnnnnnnn-------n" edc:cname="CACR" edc:impl="0xFF01" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SDHC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC0">
            <edc:SFRFieldDef edc:cname="CAPWREN" edc:desc="Capabilities Registers Write Enable (Required to write the correct frequencies in the Capabilities Registers)" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="KEY" edc:desc="Key (0x46)" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x45000234" edc:access="-------n" edc:cname="DBGR" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="SDHC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SDHC0">
            <edc:SFRFieldDef edc:cname="NIDBG" edc:desc="Non-intrusive debug enable" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="IDBG" edc:desc="Debugging is intrusive (reads of BDPR from debugger are considered and increment the internal buffer pointer)" edc:when="(field &amp; 0x1) == 0"/>
              <edc:SFRFieldSemantic edc:cname="NIDBG" edc:desc="Debugging is not intrusive (reads of BDPR from debugger are discarded and do not increment the internal buffer pointer)" edc:when="(field &amp; 0x1) == 1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:SFRDataSector>
    <edc:GPRDataSector edc:beginaddr="0x47000000" edc:endaddr="0x47002000" edc:regionid="BKUPRAM"/>
    <edc:SFRDataSector edc:beginaddr="0xE0000000" edc:endaddr="0xE0042000" edc:regionid="PPB">
      <edc:SFRDef edc:_addr="0xE0000000" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="PORT0" edc:nzwidth="0x20" ltx:memberofperipheral="ITM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ITM">
            <edc:SFRFieldDef edc:cname="PORT" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
