Microchip-MPLAB-Harmony/dev_packs/Microchip/SAME53_DFP/2.0.3/edc/ATSAME53J18A.PIC
    <edc:Pin>
      <edc:VirtualPin edc:name="PA17" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="X11" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="Y11" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PAD1" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="WO5" edc:ppsfunction="G"/>
      <edc:VirtualPin edc:name="DATA1" edc:ppsfunction="K"/>
      <edc:VirtualPin edc:name="GTXEN" edc:ppsfunction="L"/>
      <edc:VirtualPin edc:name="IO3" edc:ppsfunction="M"/>
      <edc:VirtualPin edc:name="IN1" edc:ppsfunction="N"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA18" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT2" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="X12" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="Y12" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="WO2" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="WO6" edc:ppsfunction="G"/>
      <edc:VirtualPin edc:name="DATA2" edc:ppsfunction="K"/>
      <edc:VirtualPin edc:name="GTX0" edc:ppsfunction="L"/>
      <edc:VirtualPin edc:name="CMP0" edc:ppsfunction="M"/>
      <edc:VirtualPin edc:name="IN2" edc:ppsfunction="N"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA19" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT3" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="X13" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="Y13" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="WO3" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="WO7" edc:ppsfunction="G"/>
      <edc:VirtualPin edc:name="DATA3" edc:ppsfunction="K"/>
      <edc:VirtualPin edc:name="GTX1" edc:ppsfunction="L"/>
      <edc:VirtualPin edc:name="CMP1" edc:ppsfunction="M"/>
      <edc:VirtualPin edc:name="OUT0" edc:ppsfunction="N"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB16" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="WO4" edc:ppsfunction="G"/>
      <edc:VirtualPin edc:name="SCK0" edc:ppsfunction="J"/>
      <edc:VirtualPin edc:name="IO2" edc:ppsfunction="M"/>
      <edc:VirtualPin edc:name="IN11" edc:ppsfunction="N"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB17" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PAD1" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="WO5" edc:ppsfunction="G"/>
      <edc:VirtualPin edc:name="MCK0" edc:ppsfunction="J"/>
      <edc:VirtualPin edc:name="IO3" edc:ppsfunction="M"/>
      <edc:VirtualPin edc:name="OUT3" edc:ppsfunction="N"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA20" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT4" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="X14" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="Y14" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO4" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="G"/>
      <edc:VirtualPin edc:name="FS0" edc:ppsfunction="J"/>
      <edc:VirtualPin edc:name="DATA4" edc:ppsfunction="K"/>
      <edc:VirtualPin edc:name="GMDC" edc:ppsfunction="L"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA21" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT5" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="X15" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="Y15" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO5" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="G"/>
      <edc:VirtualPin edc:name="SDO" edc:ppsfunction="J"/>
      <edc:VirtualPin edc:name="DATA5" edc:ppsfunction="K"/>
      <edc:VirtualPin edc:name="GMDIO" edc:ppsfunction="L"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA22" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT6" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="X16" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="Y16" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PAD1" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="WO6" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="WO2" edc:ppsfunction="G"/>
      <edc:VirtualPin edc:name="SDI" edc:ppsfunction="J"/>
      <edc:VirtualPin edc:name="DATA6" edc:ppsfunction="K"/>
      <edc:VirtualPin edc:name="IN6" edc:ppsfunction="N"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA23" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT7" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="X17" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="Y17" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PAD1" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="WO7" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="WO3" edc:ppsfunction="G"/>
      <edc:VirtualPin edc:name="SOF_1KHZ" edc:ppsfunction="H"/>
      <edc:VirtualPin edc:name="FS1" edc:ppsfunction="J"/>
      <edc:VirtualPin edc:name="DATA7" edc:ppsfunction="K"/>
      <edc:VirtualPin edc:name="IN7" edc:ppsfunction="N"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA24" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT8" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="WO2" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="QDI0" edc:ppsfunction="G"/>
      <edc:VirtualPin edc:name="DM" edc:ppsfunction="H"/>
      <edc:VirtualPin edc:name="IN8" edc:ppsfunction="N"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA25" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT9" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="QDI1" edc:ppsfunction="G"/>
      <edc:VirtualPin edc:name="DP" edc:ppsfunction="H"/>
      <edc:VirtualPin edc:name="OUT2" edc:ppsfunction="N"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GND"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDIO"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB22" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT6" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="QDI2" edc:ppsfunction="G"/>
      <edc:VirtualPin edc:name="SOF_1KHZ" edc:ppsfunction="H"/>
      <edc:VirtualPin edc:name="IO0" edc:ppsfunction="M"/>
      <edc:VirtualPin edc:name="IN0" edc:ppsfunction="N"/>
      <edc:VirtualPin edc:name="XIN1" edc:ppsfunction="XIN1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB23" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT7" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="QDI0" edc:ppsfunction="G"/>
      <edc:VirtualPin edc:name="IO1" edc:ppsfunction="M"/>
      <edc:VirtualPin edc:name="OUT0" edc:ppsfunction="N"/>
      <edc:VirtualPin edc:name="XOUT1" edc:ppsfunction="XOUT1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA27" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT11" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="X18" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="Y18" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="IO1" edc:ppsfunction="M"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RESET_N" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDCORE"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GND"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VSW"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDIO"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA30" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT14" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="X19" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="Y19" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="IO0" edc:ppsfunction="M"/>
      <edc:VirtualPin edc:name="IN3" edc:ppsfunction="N"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA31" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT15" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="OUT1" edc:ppsfunction="N"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB30" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT14" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PAD1" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="WO6" edc:ppsfunction="G"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB31" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT15" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="WO7" edc:ppsfunction="G"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB00" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="AIN12" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="X30" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="Y30" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="IN1" edc:ppsfunction="N"/>
      <edc:VirtualPin edc:name="IN0" edc:ppsfunction="RTC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB01" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="AIN13" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="X31" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="Y31" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="IN2" edc:ppsfunction="N"/>
      <edc:VirtualPin edc:name="OUT" edc:ppsfunction="RTC"/>
      <edc:VirtualPin edc:name="OUT0" edc:ppsfunction="SUPC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB02" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT2" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="AIN14" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="X20" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="Y20" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO2" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="OUT0" edc:ppsfunction="N"/>
      <edc:VirtualPin edc:name="IN1" edc:ppsfunction="RTC"/>
      <edc:VirtualPin edc:name="OUT1" edc:ppsfunction="SUPC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB03" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT3" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="AIN15" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="X21" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="Y21" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PAD1" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="VBAT" edc:ppsfunction="SUPC"/>
    </edc:Pin>
  </edc:PinList>
</edc:PIC>
